[
    {
        "html": "<p>This is an editor for <a href=\"http://www.openstreetmap.org/\">OpenStreetMap</a>, the\nfree and editable map of the world. You can use it to add and update\ndata in your area, making an open-source and open-data map of the world\nbetter for everyone.</p>\n<p>Edits that you make on this map will be visible to everyone who uses\nOpenStreetMap. In order to make an edit, you&#39;ll need a\n<a href=\"https://www.openstreetmap.org/user/new\">free OpenStreetMap account</a>.</p>\n<p>The <a href=\"http://ideditor.com/\">iD editor</a> is a collaborative project with <a href=\"https://github.com/systemed/iD\">source\ncode available on GitHub</a>.</p>\n",
        "title": "Help"
    },
    {
        "html": "<p>This editor is designed to work primarily online, and you&#39;re accessing\nit through a website right now.</p>\n<h3>Selecting Features</h3>\n<p>To select a map feature, like a road or point of interest, click\non it on the map. This will highlight the selected feature, open a panel with\ndetails about it, and show a menu of things you can do with the feature.</p>\n<p>Multiple features can be selected by holding the &#39;Shift&#39; key, clicking,\nand dragging on the map. This will select all features within the box\nthat&#39;s drawn, allowing you to do things with several features at once.</p>\n<h3>Saving Edits</h3>\n<p>When you make changes like editing roads, buildings, and places, these are\nstored locally until you save them to the server. Don&#39;t worry if you make\na mistake - you can undo changes by clicking the undo button, and redo\nchanges by clicking the redo button.</p>\n<p>Click &#39;Save&#39; to finish a group of edits - for instance, if you&#39;ve completed\nan area of town and would like to start on a new area. You&#39;ll have a chance\nto review what you&#39;ve done, and the editor supplies helpful suggestions\nand warnings if something doesn&#39;t seem right about the changes.</p>\n<p>If everything looks good, you can enter a short comment explaining the change\nyou made, and click &#39;Save&#39; again to post the changes\nto <a href=\"http://www.openstreetmap.org/\">OpenStreetMap.org</a>, where they are visible\nto all other users and available for others to build and improve upon.</p>\n<p>If you can&#39;t finish your edits in one sitting, you can leave the editor\nwindow and come back (on the same browser and computer), and the\neditor application will offer to restore your work.</p>\n",
        "title": "Editing & Saving"
    },
    {
        "html": "<p>You can create, fix, and delete roads with this editor. Roads can be all\nkinds: paths, highways, trails, cycleways, and more - any often-crossed\nsegment should be mappable.</p>\n<h3>Selecting</h3>\n<p>Click on a road to select it. An outline should become visible, along\nwith a small tools menu on the map and a sidebar showing more information\nabout the road.</p>\n<h3>Modifying</h3>\n<p>Often you&#39;ll see roads that aren&#39;t aligned to the imagery behind them\nor to a GPS track. You can adjust these roads so they are in the correct\nplace.</p>\n<p>First click on the road you want to change. This will highlight it and show\ncontrol points along it that you can drag to better locations. If\nyou want to add new control points for more detail, double-click a part\nof the road without a point, and one will be added.</p>\n<p>If the road connects to another road, but doesn&#39;t properly connect on\nthe map, you can drag one of its control points onto the other road in\norder to join them. Having roads connect is important for the map\nand essential for providing driving directions.</p>\n<p>You can also click the &#39;Move&#39; tool or press the <code>M</code> shortcut key to move the entire road at\none time, and then click again to save that movement.</p>\n<h3>Deleting</h3>\n<p>If a road is entirely incorrect - you can see that it doesn&#39;t exist in satellite\nimagery and ideally have confirmed locally that it&#39;s not present - you can delete\nit, which removes it from the map. Be cautious when deleting features -\nlike any other edit, the results are seen by everyone and satellite imagery\nis often out of date, so the road could simply be newly built.</p>\n<p>You can delete a road by clicking on it to select it, then clicking the\ntrash can icon or pressing the &#39;Delete&#39; key.</p>\n<h3>Creating</h3>\n<p>Found somewhere there should be a road but there isn&#39;t? Click the &#39;Line&#39;\nicon in the top-left of the editor or press the shortcut key <code>2</code> to start drawing\na line.</p>\n<p>Click on the start of the road on the map to start drawing. If the road\nbranches off from an existing road, start by clicking on the place where they connect.</p>\n<p>Then click on points along the road so that it follows the right path, according\nto satellite imagery or GPS. If the road you are drawing crosses another road, connect\nit by clicking on the intersection point. When you&#39;re done drawing, double-click\nor press &#39;Return&#39; or &#39;Enter&#39; on your keyboard.</p>\n",
        "title": "Roads"
    },
    {
        "html": "<p>GPS data is the most trusted source of data for OpenStreetMap. This editor\nsupports local traces - <code>.gpx</code> files on your local computer. You can collect\nthis kind of GPS trace with a number of smartphone applications as well as\npersonal GPS hardware.</p>\n<p>For information on how to perform a GPS survey, read\n<a href=\"http://learnosm.org/en/beginner/using-gps/\">Surveying with a GPS</a>.</p>\n<p>To use a GPX track for mapping, drag and drop the GPX file onto the map\neditor. If it&#39;s recognized, it will be added to the map as a bright green\nline. Click on the &#39;Background Settings&#39; menu on the left side to enable,\ndisable, or zoom to this new GPX-powered layer.</p>\n<p>The GPX track isn&#39;t directly uploaded to OpenStreetMap - the best way to\nuse it is to draw on the map, using it as a guide for the new features that\nyou add.</p>\n",
        "title": "GPS"
    },
    {
        "html": "<p>Aerial imagery is an important resource for mapping. A combination of\nairplane flyovers, satellite views, and freely-compiled sources are available\nin the editor under the &#39;Background Settings&#39; menu on the left.</p>\n<p>By default a <a href=\"http://www.bing.com/maps/\">Bing Maps</a> satellite layer is\npresented in the editor, but as you pan and zoom the map to new geographical\nareas, new sources will become available. Some countries, like the United\nStates, France, and Denmark have very high-quality imagery available for some areas.</p>\n<p>Imagery is sometimes offset from the map data because of a mistake on the\nimagery provider&#39;s side. If you see a lot of roads shifted from the background,\ndon&#39;t immediately move them all to match the background. Instead you can adjust\nthe imagery so that it matches the existing data by clicking &#39;Fix alignment&#39; at\nthe bottom of the Background Settings UI.</p>\n",
        "title": "Imagery"
    },
    {
        "html": "<p>Addresses are some of the most useful information for the map.</p>\n<p>Although addresses are often represented as parts of streets, in OpenStreetMap\nthey&#39;re recorded as attributes of buildings and places along streets.</p>\n<p>You can add address information to places mapped as building outlines as well\nas well as those mapped as single points. The optimal source of address\ndata is from an on-the-ground survey or personal knowledge - as with any\nother feature, copying from commercial sources like Google Maps is strictly\nforbidden.</p>\n",
        "title": "Addresses"
    },
    {
        "html": "<p>The inspector is the user interface element on the right-hand side of the\npage that appears when a feature is selected and allows you to edit its details.</p>\n<h3>Selecting a Feature Type</h3>\n<p>After you add a point, line, or area, you can choose what type of feature it\nis, like whether it&#39;s a highway or residential road, supermarket or cafe.\nThe inspector will display buttons for common feature types, and you can\nfind others by typing what you&#39;re looking for in the search box.</p>\n<p>Click the &#39;i&#39; in the bottom-right-hand corner of a feature type button to\nlearn more about it. Click a button to choose that type.</p>\n<h3>Using Forms and Editing Tags</h3>\n<p>After you choose a feature type, or when you select a feature that already\nhas a type assigned, the inspector will display fields with details about\nthe feature like its name and address.</p>\n<p>Below the fields you see, you can click icons to add other details,\nlike <a href=\"http://www.wikipedia.org/\">Wikipedia</a> information, wheelchair\naccess, and more.</p>\n<p>At the bottom of the inspector, click &#39;Additional tags&#39; to add arbitrary\nother tags to the element. <a href=\"http://taginfo.openstreetmap.org/\">Taginfo</a> is a\ngreat resource for learn more about popular tag combinations.</p>\n<p>Changes you make in the inspector are automatically applied to the map.\nYou can undo them at any time by clicking the &#39;Undo&#39; button.</p>\n<h3>Closing the Inspector</h3>\n<p>You can close the inspector by clicking the close button in the top-right,\npressing the &#39;Escape&#39; key, or clicking on the map.</p>\n",
        "title": "Using the Inspector"
    },
    {
        "html": "<p>OpenStreetMap is the world&#39;s largest database of buildings. You can create\nand improve this database.</p>\n<h3>Selecting</h3>\n<p>You can select a building by clicking on its border. This will highlight the\nbuilding and open a small tools menu and a sidebar showing more information\nabout the building.</p>\n<h3>Modifying</h3>\n<p>Sometimes buildings are incorrectly placed or have incorrect tags.</p>\n<p>To move an entire building, select it, then click the &#39;Move&#39; tool. Move your\nmouse to shift the building, and click when it&#39;s correctly placed.</p>\n<p>To fix the specific shape of a building, click and drag the points that form\nits border into better places.</p>\n<h3>Creating</h3>\n<p>One of the main questions around adding buildings to the map is that\nOpenStreetMap records buildings both as shapes and points. The rule of thumb\nis to <em>map a building as a shape whenever possible</em>, and map companies, homes,\namenities, and other things that operate out of buildings as points placed\nwithin the building shape.</p>\n<p>Start drawing a building as a shape by clicking the &#39;Area&#39; button in the top\nleft of the interface, and end it either by pressing &#39;Return&#39; on your keyboard\nor clicking on the first point drawn to close the shape.</p>\n<h3>Deleting</h3>\n<p>If a building is entirely incorrect - you can see that it doesn&#39;t exist in satellite\nimagery and ideally have confirmed locally that it&#39;s not present - you can delete\nit, which removes it from the map. Be cautious when deleting features -\nlike any other edit, the results are seen by everyone and satellite imagery\nis often out of date, so the road could simply be newly built.</p>\n<p>You can delete a building by clicking on it to select it, then clicking the\ntrash can icon or pressing the &#39;Delete&#39; key.</p>\n",
        "title": "Buildings"
    }
]